of/org/Myanmar/transient/5/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// internalField   uniform (25.75 3.62 0);
internalField   uniform (5 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        // freestreamValue uniform (25.75 3.62 0);
        freestreamValue uniform (5 0 0);
    }

    outlet
    {
        type            freestream;
        // freestreamValue uniform (25.75 3.62 0);
        freestreamValue uniform (5 0 0);
    }

    top
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            symmetryPlane;
    }

    deck
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
