of/org/Myanmar/transient/5/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
//    div(phi,U)      Gauss limitedLinearV 1;
//    div(phi,k)      Gauss limitedLinear 1;
//    div(phi,epsilon) Gauss limitedLinear 1;
//    div(phi,omega)  Gauss limitedLinear 1;
//    div(phi,R)      Gauss limitedLinear 1;
//    div(R)          Gauss linear;
//    div(phi,nuTilda) Gauss limitedLinear 1;
//    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{

    default         none;
    laplacian(nu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear orthogonal;

//    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default         orthogonal;
//    default         corrected;
// wallDist
// {
//     method meshWave;
// }

fluxRequired
{
    default         no;
    p               ;
}

// ************************************************************************* //
